Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.ImportCustomComponentItems Method
 Imports custom component items (*.uel) from path to component catalog. Import overrides the existing custom components in the catalog without any warnings.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ImportCustomComponentItems(
	string path
)
Public Function ImportCustomComponentItems (
	path As String
) As Boolean
Parameters
path
Type: System.String
The path to be used for import. This can be a uel file or a folder containing one or more uel files.
Return Value
Type: Boolean
true if successful.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           if (new CatalogHandler().ImportCustomComponentItems(System.IO.Path.GetTempPath()))
               Console.WriteLine("Custom components imported successfully to catalog.");
       }
}
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace